//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
let num1 = prompt('Введіть перше число');
let num2 = prompt('Введіть друге число');
if (num1 !== num2){
    console.log(Math.max(num1,num2));
}else{
    console.log('Equal!');
}
//- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let flatNum = prompt("Введіть номер вашої квартири");
if (flatNum >= 1 && flatNum <= 20){
    alert("Ваш під'їзд під номером 1");
}else if(flatNum >= 21 && flatNum <= 48){
    alert("Ваш під'їзд під номером 2");
}else if(flatNum >= 49 && flatNum <= 90){
    alert("Ваш під'їзд під номером 3");
}else{
    alert('Квартири з таким номером немає!');
}
//- Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let numb = +prompt('Enter your value');
if (numb === 10){
    console.log('Вірно!');
}else{
    console.log('Невірно!');
}
//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
let x = prompt('Введіть данні');
if ((typeof x) === "number") {
    console.log(1);
}else if ((typeof x)=== "string"){
    console.log(2);
}else if ((typeof x) === {}){
    console.log(3);
}
//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let temp = +prompt('Enter the temperature');
if (temp >= 10 && temp <=22){
    alert('Йдемо вчитися');
}else{
    alert('Вчимося онлайн');
}
//- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let value = +prompt('Enter the value');
switch (value){
    case 1:
    case 2:
        console.log('Ви виграли авто');
        break;
    case 3:
    case 4:
        console.log('Ви виграли мотоцикл');
        break;
    case 5:
        console.log('Ви виграли телефон');
        break
    default:
        alert('Число не вірне');
        break;
}

